Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t
The shape cleaning parameters to control the result of the cleaning. It is the "twin" of dotcatShapeCleanParams_t in
TeklaStructures.sln. If you add fields here, make the same changes there.

Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t.EdgeVisibilityThresholdAngleInDegrees
Defines an angle in degrees that is used to decide whether an edge in the polymesh of the shape is
considered to be invisible or visible. See the following two booleans for more related info.

Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t.ChangeEdgesToInvisible
Set this to true if you want VISIBLE edges, that have a neighbor face normal vector angle difference less than
EdgeVisibilityThresholdAngle to be set as INVISIBLE in the cleaned shape, false otherwise.

Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t.ChangeEdgesToVisible
Set this to true if you want INVISIBLE edges, that have a neighbor face normal vector angle difference greater than
EdgeVisibilityThresholdAngle to be set as VISIBLE in the cleaned shape, false otherwise.